title: Raccoon Stealer v2
description: Raccoon Stealer v2
author: Cem Unal
references:
- https://otx.alienvault.com/pulse/62bc0b6350878b6e366cafe8
date: 2022/06/29
status: experimental
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    file_hash:
    - 7a2ef36c5dbf72b92b1adfb52e1e5426
    - b35cde0ed02bf71f1a87721d09746f7b
    - eca370e62443218965eb27b1a61bb7a0
    - 88a354d8d051d4dd8c741cdf3e986244
    - 0cfa58846e43dd67b6d9f29e97f6c53e
    - 7894ab366f0b984ce78d7ef9724cec0d
    - c5ce68e5feabffe94ce4309e9e278a91
    - 16bae91061e6410ddf2c17b544939d87
    - d28ba705f24c9e51564c46aefab26754
    - 0cf266265f77e387a9d396888651240f2b458e0a
    - 4e48d0c38e0a4543137cd381abb38e6bd17f17aa
    - abe82a1405471258c72d031191846ea627f1c63c
    - b47cc17316ef37a18919eedd0ec16908febac7a1
    - 19d9fbfd9b23d4bd435746a524443f1a962d42fa
    - 48ca383575fdc914ed3436d40201eae6bac55007
    - ab272e68f0e09391e3675cf8cda344774ae98769
    - 0c6bb0d8f2611775b495a019c63f95b1377f2054
    - 531b6c546b26eeb9e33560292bb756b47affbeaa
    - 27e02b973771d43531c97eb5d3fb662f9247e85c4135fe4c030587a8dea72577
    - 47f3c8bf3329c2ef862cf12567849555b17b930c8d7c0d571f4e112dae1453b1
    - f7b1aaae018d5287444990606fc43a0f2deb4ac0c7b2712cc28331781d43ae27
    - 0123b26df3c79bac0a3fda79072e36c159cfd1824ae3fd4b7f9dea9bda9c7909
    - 048c0113233ddc1250c269c74c9c9b8e9ad3e4dae3533ff0412d02b06bdf4059
    - 2106b6f94cebb55b1d55eb4b91fa83aef051c8866c54bb75ea4fd304711c4dfc
    - 5d66919291b68ab8563deedf8d5575fd91460d1adfbd12dba292262a764a5c99
    - 7299026b22e61b0f9765eb63e42253f7e5d6ec4657008ea60aad220bbc7e2269
    - 960ce3cc26c8313b0fe41197e2aff5533f5f3efb1ba2970190779bc9a07bea63
    - 9ee50e94a731872a74f47780317850ae2b9fae9d6c53a957ed7187173feb4f42
    - c6e669806594be6ab9b46434f196a61418484ba1eda3496789840bec0dff119a
    - 022432f770bf0e7c5260100fcde2ec7c49f68716751fd7d8b9e113bf06167e03
    - 2911be45ad496dd1945f95c47b7f7738ad03849329fcec9c464dfaeb5081f67e
    - 516c81438ac269de2b632fb1c59f4e36c3d714e0929a969ec971430d2d63ac4e
    - 0c722728ca1a996bbb83455332fa27018158cef21ad35dc057191a0353960256
    - 263c18c86071d085c69f2096460c6b418ae414d3ea92c0c2e75ef7cb47bbe693
    - 62049575053b432e93b176da7afcbe49387111b3a3d927b06c5b251ea82e5975
    - 7322fbc16e20a7ef2a3188638014a053c6948d9e34ecd42cb9771bdcd0f82db0
    - 99f510990f240215e24ef4dd1d22d485bf8c79f8ef3e963c4787a8eb6bf0b9ac
    - bd8c1068561d366831e5712c2d58aecb21e2dbc2ae7c76102da6b00ea15e259e
    - e309a7a942d390801e8fedc129c6e3c34e44aae3d1aced1d723bc531730b08f5
  condition: selection
fields:
- Hashes
falsepositives:
- Unknown
level: high
tags:
- attack.t1005
- attack.t1012
- attack.t1027
- attack.t1041
- attack.t1055
- attack.t1057
- attack.t1071
- attack.t1082
- attack.t1083
- attack.t1105
- attack.t1106
- attack.t1113
- attack.t1119
- attack.t1124
- attack.t1140
- attack.t1407
- attack.t1518
- attack.t1539
- attack.t1547
- attack.t1555
- attack.t1614
